Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicTagAttributes Class
 The ViewMarkBasicTagAttributes class contains basic attributes for view mark tags.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes
 Tekla.Structures.Drawing.View.ViewMarkTagAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ViewMarkBasicTagAttributes : GenericAttributesBase
<SerializableAttribute>
Public Class ViewMarkBasicTagAttributes
	Inherits GenericAttributesBase
The ViewMarkBasicTagAttributes type exposes the following members.
Constructors
Name | Description
ViewMarkBasicTagAttributes()
 Creates a new mark tag attributes instance.
ViewMarkBasicTagAttributes(Vector, TagLocation, ContainerElement)
 Creates a new mark tag attributes instance with the given offset, location and content.
Top
Properties
Name | Description
Location
 The location of the mark tag.
Offset
 The offset of the mark tag.
TagContent
 The tag content.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace